def read_natural(prompt=""):
    while True:
        s = input(prompt).strip()
        if s.isascii() and s.isdigit() and int(s) > 0:
            return int(s)
        print("ошибка: поддерживаются только натуральные числа")

k = read_natural()
n = read_natural()

page = (n - 1) // k + 1
line = (n - 1) % k + 1

print(page, line)

#  У книзі на одній сторінці поміщається k рядків.
#  Таким чином, на 1 -й сторінці друкуються рядки з 1 -го по k-й,
#  на другій сторінці - з (k + 1) -й по (2 * k) -й і т. д.
#  Напишіть програму,на вхід якої подається кількість рядків k на сторінці
#  і номер рядка n в тексті, по якому визначається номер сторінки, на якій
#  буде надрукований цей рядок, і порядковий номер цього рядка на сторінці.

#   Вхідні дані:

#       20
#       25
#   Вихідні дані:

#       2
#       5