class MoneyBox:

    def __init__(self, capacity):
        self.capacity = capacity
        self.coins = 0

    def can_add(self, v):
        return self.coins + v <= self.capacity

    def add(self, v):
        self.coins += v

def read_int():
    while True:
        s = input()
        try:
            return int(s)
        except ValueError:
            print("ошибка: поддерживаются только целые числа")

while True:
    try:
        n = read_int()
        m = read_int()
        k = read_int()
    except EOFError:
        break
    box = MoneyBox(n)
    box.add(m)
    print(box.can_add(k))

# Реалізуйте клас МопеуВох для роботи з віртуальною скарбничкою. 
# Кожна скарбничка має обмежену місткість, яка виражається цілим 
# числом n - кількістю монет, які можна покласти в скарбничку. 
# Клас повинен підтримувати інформацію про кількість монет в скарбничці,
# надавати можливість додавати монети в скарбничку і дізнаватися,
# чи можна додати в скарбничку ще якусь кількість монет,
# не перевищуючи її місткість.

#При створенні скарбнички, число монет в ній дорівнює 0. 
# Врахуйте, що метод add(self, v) буде викликатися лише тоді, 
# якщо can_add(self, v) повертає True. 
# Дані вводиться користувачем в такому порядку:
# n - місткість скарбнички, m - скільки монет поклали в скарбничку, 
# k - кількість монет, які хочуть покласти в скарбничку. 
# Результатом має бути одне з двох значень: True чи False.

#   Вхідні дані:

#       10
#       6
#       3

#       10
#       6
#       5
#   Вихідні дані:

#       True

#       False